src/Documents/ПередачаНаЛинейку/ПередачаНаЛинейку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаНаЛинейку</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиНаЛинейки</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ПередачиНаЛинейки/ПередачиНаЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПередачиНаЛинейки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаНаЛинейку</name>
    <type>
      <types>DocumentRef.ПередачаНаЛинейку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПередачаНаЛинейку/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
	ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
	Иначе
	ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
	КонецЕсли;
КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХранения,МПЗ,Дата);
	Если КолОстаток >= Количество Тогда
	// регистр МестаХранения Расход
	Движения.МестаХранения.Записывать = Истина;
	Движение = Движения.МестаХранения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХранения;
	Движение.ВидМПЗ = ВидМПЗ;
	Движение.МПЗ = МПЗ;
	Движение.Количество = Количество;
	Иначе
	Отказ = Истина;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Текст = "МПЗ: "+СокрЛП(МПЗ.Наименование)+" требуется передать: "+Количество+" недостаёт на складе: "+Строка(Количество-КолОстаток);
	Сообщение.Сообщить();
	КонецЕсли;

// регистр ПередачиНаЛинейки Приход
Движения.ПередачиНаЛинейки.Записывать = Истина;
Движение = Движения.ПередачиНаЛинейки.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
Движение.Период = Дата;
Движение.МестоХранения = МестоХраненияКанбанов;
Движение.НомерЯчейки = НомерЯчейки;
Движение.ВидМПЗ = ВидМПЗ;
Движение.МПЗ = МПЗ;
Движение.Количество = Количество;
Движение.ПередачаНаЛинейку = Ссылка; 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры
